
// alert("Hello, Andrei!!!")
// console.log(Hello)

/* Переменные 
let myNumber = 10
console.log(myNumber)
LET
CONST
VAR
3 варианта объявления
переменных
Старый вариант записи - var
Новый вариант записи - let
Неизменяемая переменная - const*/

// Выражение и инструкции
/*Выражение возвращает значение   ---- 
Инструкции не возвращают значение.___
Выражения:
10
"Dima"
myName="Andrei"
console.log();
20+50
a <= b || c != b*/
/* Инструкции
управление потоком выполнения (if и eise, fhrow и т.д.)
интерации (for, while и т.д.))
объявлеения значений (var, let, const) */
/*Типы данных : восемь типов - семь примbтивных и один ссылочный:
Ссылочный : Object;
Примитивные :
    Число (Number)
    Строка(String)
    Логическое(Boolean)
    Undefined
    Null
    Symbol
    Biglnt
____________________________________________________ */   
// const myNumber = 10

// console.log(myNumber)
// console.log(typeof myNumber)
/* 9. Особенности чисел и строк
    Infinity    - бесконечность
    -Infinity
    NaN         - при ошибки
 Три вида кавычек :
    Для строк : "";''.
    Для выражения внутри строк :  `... ` (Ё-клавиша)*/
// const name = "andrei"
// console.log(`Hello ${name}`)
// console.log(`Hello ${2*2}`)
// console.log(`Hello ${name}`)
/* 11. Введение в операторы. Математические операторы + -  
Любой оператор - возвращает значение.
    let a = 2
    a = a + 5 (a += 5)
 Операторы инкремента и декремента :
    инкремента - 
        постфиксная форма - myAge++
                            myAge--
        
    декремента - 
    префиксная  форма - ++myAge
                        --myAge  */
/* 12. Как работают Операторы сравнения  ==  !=
  14. Приоритетность операторов
 ____________________________________________ 
  15. Преобразование типов данных
Три преобразования:  функции
    Строковое   String() - alert(100) - "100"
    Численное   Number() - +"100"     -  100
    Логическое  Boolean()
 _____________________________________________
 16. Стандартные объекты. Подводим итоги и повторяем.
19. Знакомство с If Else. Условное ветвление
 if(условие) {
    выполнить это
 }
*/
 


